src/InformationRegisters/ГраницаМФП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ГраницаМФП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ГраницаМФП/Ext/ManagerModule.bsl
Процедура ДобавитьЗапись(СсылкаНаДокумент, ДатаДокумента = Неопределено ) Экспорт
	
	Если ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаСоздания = НачалоДня(ДатаДокумента);
	Иначе
		ДатаСоздания = НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "Дата"));
	КонецЕсли;
	
	Если Не ПроведениеДокументовКлиентСервер.ИспользуютсяМФП(ДатаСоздания) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГраницаМФП.ДатаСоздания
		|ИЗ
		|	РегистрСведений.ГраницаМФП КАК ГраницаМФП
		|ГДЕ
		|	ГраницаМФП.ДатаСоздания = &ДатаСоздания";
	
	Запрос.УстановитьПараметр("ДатаСоздания", ДатаСоздания);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		МЗ = РегистрыСведений.ГраницаМФП.СоздатьМенеджерЗаписи();
		МЗ.ДатаСоздания 	= ДатаСоздания;
		МЗ.Документ	 		= СсылкаНаДокумент;
		МЗ.Пользователь		= ПараметрыСеанса.ТекущийПользователь;
		МЗ.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьЗапись(ДатаСоздания) Экспорт
	
	Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
		Возврат;
	КонецЕсли;
	
	НЗ = РегистрыСведений.ГраницаМФП.СоздатьНаборЗаписей();
	НЗ.Отбор.ДатаСоздания.Установить(ДатаСоздания);
	НЗ.Записать();
	
КонецПроцедуры
	
//Неактуально

//Сдвигает границу назад, если переданная дата меньше границы
Процедура Добавить(СсылкаНаДокумент, ДатаДокумента = Неопределено ) Экспорт
	
	Если ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаСоздания = НачалоДня(ДатаДокумента);
	Иначе
		ДатаСоздания = НачалоДня(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "Дата"));
	КонецЕсли;
	
	Если Не ПроведениеДокументовКлиентСервер.ИспользуютсяМФП(ДатаСоздания) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГраницаМФП.ДатаСоздания
		|ИЗ
		|	РегистрСведений.ГраницаМФП КАК ГраницаМФП
		|ГДЕ
		|	ГраницаМФП.ДатаСоздания <= &ДатаСоздания";
	
	Запрос.УстановитьПараметр("ДатаСоздания", ДатаСоздания);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		 НЗ = РегистрыСведений.ГраницаМФП.СоздатьНаборЗаписей();
		 НоваяЗапись =  НЗ.Добавить();
		 НоваяЗапись.ДатаСоздания 	= ДатаСоздания;
		 НоваяЗапись.Документ	 	= СсылкаНаДокумент;
		 НоваяЗапись.Пользователь	= ПараметрыСеанса.ТекущийПользователь;
		 НЗ.Записать();
	КонецЕсли;
	
КонецПроцедуры

//Сдвигает границу вперед, если переданная дата совпадает с датой границы
Процедура СдвинутьГраницу(ОбработаннаяДата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГраницаМФП.ДатаСоздания
		|ИЗ
		|	РегистрСведений.ГраницаМФП КАК ГраницаМФП
		|ГДЕ
		|	ГраницаМФП.ДатаСоздания = &ОбработаннаяДата";
	
	Запрос.УстановитьПараметр("ОбработаннаяДата", ОбработаннаяДата);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		 НЗ = РегистрыСведений.ГраницаМФП.СоздатьНаборЗаписей();
		 НоваяЗапись 				=  НЗ.Добавить();
		 НоваяЗапись.ДатаСоздания 	= ОбработаннаяДата+86400;
		 НоваяЗапись.Пользователь	= ПараметрыСеанса.ТекущийПользователь;
		 НЗ.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьГраницу() Экспорт
	
	СтруктураГраницы = Новый Структура("Дата, Документ, Пользователь", Дата(1,1,1), Неопределено, Неопределено);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГраницаМФП.ДатаСоздания КАК Дата,
		|	ГраницаМФП.Пользователь КАК Пользователь,
		|	ГраницаМФП.Документ КАК Документ
		|ИЗ
		|	РегистрСведений.ГраницаМФП КАК ГраницаМФП";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураГраницы, Выборка);
	КонецЕсли;
	
	Возврат СтруктураГраницы;	
	
КонецФункции
